Revit 2027 API
SpotLightDistribution Constructor
 Creates a spot light distribution object with the following values;
PI/6 radians spot beam angle
PI/2 radians spot field angle
PI/6 radians tilt angle
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpotLightDistribution()
Public Sub New
public:
SpotLightDistribution()
new : unit -> SpotLightDistribution
See Also
Reference
SpotLightDistribution Class
SpotLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace